In [2]:
import numpy as np
import pandas as pd

In [50]:
df = pd.read_csv('agora.csv')

In [51]:
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.41       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [52]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [26]:
#Handle null value

In [27]:
mean = df.Transport.mean()
median = df.Transport.median()

In [28]:
mean
median

407934.54

In [29]:
mean

414597.042

In [30]:
median

407934.54

In [31]:
df['Transport'] = df.Transport.fillna(median)

In [32]:
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.41       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Encoding (Manually)

In [17]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [18]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])

In [19]:
df

   Marketing Spend  Administration  Transport  Area     Profit  Trandport
0        114523.61       136897.80  471784.10     3  192261.83  471784.10
1        162597.70       151377.59  443898.53     2  191792.06  443898.53
2        153441.41       101145.55  407934.54     1  191050.39  407934.54
3        144372.41       118671.85  383199.62     3  182901.99  383199.62
4        142107.34        91391.77  366168.42     1  166187.94  366168.42

# Label Encoding

In [21]:
from sklearn.preprocessing import LabelEncoder

In [22]:
label = LabelEncoder()

In [33]:
df.Area = label.fit_transform(df['Area'])

In [34]:
df

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.41       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

In [36]:
#Loop
for column in df.columns:
    if df[column].dtype == np.number:
        continue
    df[column] = LabelEncoder().fit_transform(df[column])

C:\Users\shari\AppData\Local\Temp/ipykernel_11280/3552907764.py:3: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [38]:
df.Area

0    1
1    0
2    2
3    1
4    2
Name: Area, dtype: int64

In [41]:
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.41       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [44]:
dummy_variables = pd.get_dummies(df['Area'], drop_first = True)
dummy_variables

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [46]:
new_df  = df.drop('Area', axis=1)

In [47]:
new_df

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.41       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [48]:
df = pd.concat([new_df,dummy_variables], axis=1)

In [49]:
df

   Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10  192261.83      1        0
1        162597.70       151377.59  443898.53  191792.06      0        0
2        153441.41       101145.55  407934.54  191050.39      0        1
3        144372.41       118671.85  383199.62  182901.99      1        0
4        142107.34        91391.77  366168.42  166187.94      0        1

# Ordinal Encoder

In [53]:
from sklearn.preprocessing import OrdinalEncoder

In [54]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [55]:
city_list = ['Dhaka', 'Ctg', 'Rangpur']

In [56]:
ordinal = OrdinalEncoder(categories= [city_list])

In [57]:
encoded_values = ordinal.fit_transform(df[['Area']])

In [58]:
encoded_values

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.]])

In [61]:
new_area=pd.DataFrame(encoded_values, columns=['Area'])

In [62]:
new_area

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0

In [63]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.41       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [65]:
df.Area= new_area

In [66]:
df

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.41       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94


\
# Hashing Encoder

In [69]:
import category_encoders

ModuleNotFoundError: No module named 'category_encoders'